Results_180919_500/results/apache_performance_00386/mn.mp.input.vdu01.0/tngbench_share/cmd_start.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.0.0.254 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Apache/2.4.18
Server Hostname:        20.0.0.254
Server Port:            80

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      10000
Time taken for tests:   6.920 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1800000 bytes
HTML transferred:       130000 bytes
Requests per second:    1445.07 [#/sec] (mean)
Time per request:       6920.090 [ms] (mean)
Time per request:       0.692 [ms] (mean, across all concurrent requests)
Transfer rate:          254.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7  57.9      0    3024
Processing:     2  154 743.1     32    6708
Waiting:        2  154 743.1     32    6708
Total:         28  161 767.0     32    6916

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     32
  75%     33
  80%     33
  90%     50
  95%    637
  98%    642
  99%   6893
 100%   6916 (longest request)